{"/en/docs/":{"data":{"need-help#Need Help?":"💬 Contact Support 📧 Email Us 📖 Visit Our Forum Tip: Use the search function at the top of the page to quickly find the information you need.","qwer-host-wiki#qwer-host Wiki":"qwer-host WikiWelcome to qwer-host documentation! This is a centralized knowledge base for working with our gaming servers and web services.\nOur wiki contains detailed guides for Minecraft server administration, plugin configuration, web resource management, and technical issue resolution. All the necessary information for efficient work with our infrastructure is collected here."},"title":"Documentation"},"/en/docs/cloudflare/":{"data":{"additional-resources#Additional Resources":"Official CloudFlare Documentation CloudFlare API Documentation CloudFlare Community","available-guides#Available Guides":"This section includes the following instructions:\nLinking a Domain to Minecraft Server — how to configure A and SRV records for a beautiful server address Disabling Encrypted Client Hello (ECH) — how to disable ECH via API for users from Russia Important: Working with the CloudFlare API requires caution. Always backup your settings and verify the correctness of the data you enter.","cloudflare-guides-and-instructions#CloudFlare: Guides and Instructions":"CloudFlare: Guides and InstructionsCloudFlare is a global content delivery network (CDN) and web security platform. In this section, you’ll find useful guides for configuring and managing your domains through CloudFlare.","main-cloudflare-features#Main CloudFlare Features":"CloudFlare provides many features:\nCDN — website acceleration through a distributed server network DDoS Protection — protection against distributed attacks SSL/TLS — free SSL certificates DNS Management — fast and reliable DNS servers Firewall — customizable security rules"},"title":"CloudFlare"},"/en/docs/cloudflare/disable-ech/":{"data":{"1-request-setup#1. Request Setup":"Method: PATCH URL: https://api.cloudflare.com/client/v4/zones/{ID_ZONE}/settings/ech","2-headers-setup#2. Headers Setup":"In the Headers section, add the following fields:\nKey Value X-Auth-Email your Cloudflare email address X-Auth-Key your Global API Key Content-Type application/json","3-body-setup#3. Body Setup":"In the Body section, select raw and JSON, then enter:\n{ \"id\": \"ech\", \"value\": \"off\" }","4-send-request#4. Send Request":"Click the Send button and wait for the server response.","additional-resources#Additional Resources":"Official Cloudflare API Documentation SSL/TLS Configuration Guide for Cloudflare Cloudflare Community Need help? If you encounter difficulties disabling ECH, contact Cloudflare support or community forums.","authentication-error#Authentication Error":"Problem: Receiving Authentication error or Invalid credentials\nSolution:\nVerify your email address is correct Ensure you’ve copied the Global API Key completely Check that you haven’t added extra spaces when copying","common-issues-and-solutions#Common Issues and Solutions":"","disabling-encrypted-client-hello-ech-on-cloudflare-free-tier-via-api#Disabling Encrypted Client Hello (ECH) on Cloudflare Free Tier via API":"Disabling Encrypted Client Hello (ECH) on Cloudflare Free Tier via API","ech-doesnt-disable#ECH Doesn\u0026rsquo;t Disable":"Problem: After executing the command, ECH remains enabled\nSolution:\nWait 10-15 minutes for changes to apply Clear the DNS cache on your device Retry the API request","global-api-key#Global API Key":"Go to the Cloudflare profile page Find the section with your Global API Key and copy the key Important: The Global API Key provides full access to your account. Never share it with third parties and store it securely!","method-1-using-curl-command#Method 1: Using curl Command":"To disable ECH, execute the following command in your terminal, replacing {ID_ZONE}, {ACCOUNT_EMAIL}, and {GLOBAL_API_KEY} with your data:\ncurl -X PATCH \"https://api.cloudflare.com/client/v4/zones/{ID_ZONE}/settings/ech\" \\ -H \"X-Auth-Email: {ACCOUNT_EMAIL}\" \\ -H \"X-Auth-Key: {GLOBAL_API_KEY}\" \\ -H \"Content-Type: application/json\" \\ --data '{\"id\":\"ech\",\"value\":\"off\"}'\rExample:\ncurl -X PATCH \"https://api.cloudflare.com/client/v4/zones/abc123def456/settings/ech\" \\ -H \"X-Auth-Email: user@example.com\" \\ -H \"X-Auth-Key: c2547eb745079dac9320b638f5e225cf483cc5cfdda41\" \\ -H \"Content-Type: application/json\" \\ --data '{\"id\":\"ech\",\"value\":\"off\"}'\rUpon successful execution, you’ll receive a JSON response confirming the setting change.","method-2-using-postman#Method 2: Using Postman":"You can execute this request through Postman by following these instructions:","method-3-for-paid-plans#Method 3: For Paid Plans":"If you’re using a paid Cloudflare plan, you can disable ECH through the dashboard interface:\nNavigate to the SSL/TLS section Open the Edge Certificates tab Find the Encrypted ClientHello (ECH) setting Set the value to Disabled Note: This option is only available for paid plan users (Pro, Business, Enterprise).","step-1-check-if-ech-is-enabled#Step 1: Check if ECH is Enabled":"Before disabling ECH, verify whether it’s enabled for your domain. You can do this using a Google Public DNS query:\nNavigate to the following link, replacing [YOUR_DOMAIN] with your domain name: https://dns.google/resolve?name=[YOUR_DOMAIN]\u0026type=HTTPS\rIf the results show that ECH is active, proceed to the next step. Example: For the domain example.com, the link would look like:\nhttps://dns.google/resolve?name=example.com\u0026type=HTTPS","step-2-obtain-cloudflare-api-credentials#Step 2: Obtain Cloudflare API Credentials":"To interact with the API, you’ll need two key elements:","step-3-disable-ech-via-cloudflare-api#Step 3: Disable ECH via Cloudflare API":"","verify-the-results#Verify the Results":"After disabling ECH, it’s recommended to verify the changes:\nWait 5-10 minutes for the settings to apply Run the Google Public DNS check again (Step 1) Check your website’s accessibility for users from Russia Done! ECH is now disabled for your domain, and the site should be accessible to Russian users.","why-disable-ech#Why Disable ECH?":"Roskomnadzor (Russian telecommunications regulator) has blocked the Encrypted Client Hello (ECH) technology, causing issues for Cloudflare users in Russia. Moreover, Cloudflare has forcibly enabled this technology for all users, including those on the free tier.\nThis guide will show you how to disable ECH for your domain using the Cloudflare API.\nFor users from Russia: Disabling ECH may be necessary to ensure your website’s accessibility for Russian users due to Roskomnadzor’s blocking of this technology.","zone-id#Zone ID":"Log in to your domain’s Cloudflare dashboard Scroll down the page in the right column Copy the Zone ID value Zone ID is the unique identifier for your domain in the Cloudflare system.","zone-id-error#Zone ID Error":"Problem: Receiving Zone not found error\nSolution:\nMake sure the Zone ID is copied correctly Verify you’re using the Zone ID for the domain you want to modify"},"title":"Disabling Encrypted Client Hello (ECH)"},"/en/docs/cloudflare/domain-setup/":{"data":{"-cloudflare-shows-error-when-creating-record#❌ Cloudflare shows error when creating record":"Cause: Incorrect data format\nSolution:\nEnsure Target ends with . or contains a fully qualified domain name Check that all required fields are filled Use only allowed characters (a-z, 0-9, hyphen, period)","-error-connection-via-domain-works-but-with-wrong-port#❌ Error: Connection via domain works but with wrong port":"Cause: SRV record is misconfigured or missing\nSolution:\nCheck for the presence of an SRV record Ensure the port is specified correctly Verify the Name format: _minecraft._tcp.(subdomain)","-error-unknown-host#❌ Error: \u0026ldquo;Unknown host\u0026rdquo;":"Causes:\nDNS records haven’t propagated yet Error in A record configuration Proxy Status is enabled (orange cloud) Solution:\nCheck that Proxy Status is disabled for the A record Wait 15-30 minutes Clear DNS cache on your computer: Windows: ipconfig /flushdns macOS: sudo dscacheutil -flushcache Linux: sudo systemd-resolve --flush-caches","1-check-a-record#1. Check A Record":"Execute the command in terminal:\nnslookup play.mhcore.xyz\rYou should see your server’s IP address in the result.","2-check-srv-record#2. Check SRV Record":"nslookup -type=srv _minecraft._tcp.play.mhcore.xyz\rInformation about the port and target address should be displayed.","3-test-via-minecraft#3. Test via Minecraft":"Simply try connecting to the server through the Minecraft client using your new domain!","additional-capabilities#Additional Capabilities":"","additional-where-to-store-screenshots#Additional: Where to Store Screenshots?":"Place screenshots for documentation in the folder:\nstatic/images/docs/cloudflare/\rStructure:\na-record.png — A record configuration screenshot srv-record.png — SRV record configuration screenshot To insert an image in documentation, use:\n![Image description](/images/docs/cloudflare/filename.png)","common-errors-and-solutions#Common Errors and Solutions":"","how-to-use-your-domain-instead-of-an-ip-address#How to Use Your Domain Instead of an IP Address?":"How to Use Your Domain Instead of an IP Address?Linking a domain to your server is necessary to make the connection process simpler and faster. Typically, an IP address is used for connection, which can be long and difficult to remember (123.45.67.89:1234).\nIf you link a domain, for example, play.mhcore.xyz, it will be easier for players to remember, which can help attract an audience to your server.\nWhy do you need this?\nEasy to remember: play.mhcore.xyz instead of 123.45.67.89:25565 Professional appearance for your server Ability to change hosting without changing the address for players","method-1-setup-via-a-record-recommended#Method 1: Setup via A Record (Recommended)":"","method-2-setup-without-a-record-alternative#Method 2: Setup Without A Record (Alternative)":"If your server is hosted on MHCore, you can use the node address directly:","multiple-servers-on-one-domain#Multiple Servers on One Domain":"You can create multiple subdomains for different servers:\nplay.mhcore.xyz — main server lobby.mhcore.xyz — lobby server creative.mhcore.xyz — creative mode minigames.mhcore.xyz — mini-games For each, create separate A and SRV records with different names and ports!","preparation#Preparation":"Important to remember!\nTo begin, you need to:\nPurchase a domain (for example, on Namecheap, GoDaddy, REG.RU, etc.) Transfer it to Cloudflare (free, but mandatory for this guide) If you already have a domain in Cloudflare — proceed to the next step!","result#Result":"According to the example above, your server will be accessible at:\nplay.mhcore.xyz\rPlayers will be able to connect to the server by simply entering this address in Minecraft, without specifying the port!\nDone! 🎉\nNow players can connect to your server using a beautiful and memorable address!","step-1-open-cloudflare-dashboard#Step 1: Open Cloudflare Dashboard":"Go to Cloudflare Log in to your account You will see a list of all your domains","step-2-select-your-domain#Step 2: Select Your Domain":"From the list of domains, select the one you want to use for your Minecraft server.","step-3-navigate-to-the-dns-tab#Step 3: Navigate to the \u0026ldquo;DNS\u0026rdquo; Tab":"In the top menu, find and click on DNS → Records.","step-4-alternative-create-only-srv-record#Step 4 (alternative): Create Only SRV Record":"Field Value Type SRV Name _minecraft._tcp.play Priority 5 Weight 5 Port 25565 (your server port) Target node1.mhcore.xyz (your node name) For MHCore Users: In Target, specify your node address in the format: (node_name).mhcore.xyz\nExample: node1.mhcore.xyz, node2.mhcore.xyz, etc.","step-4-create-a-new-a-record#Step 4: Create a New A Record":"Click the Add record button and fill in the fields as follows:\nField Value Description Type A Record type Name play Any name (subdomain) IPv4 address 123.45.67.89 Your server’s IP address WITHOUT PORT Proxy status 🔴 OFF Orange cloud must be disabled (gray) TTL Auto Leave unchanged Critically important:\nProxy Status (orange cloud) MUST be disabled! In IPv4, specify the IP WITHOUT PORT (e.g., 123.45.67.89, not 123.45.67.89:25565) Example A Record Configuration:\nSave the record by clicking Save.","step-5-create-a-new-srv-record#Step 5: Create a New SRV Record":"Now create an SRV record to specify the server port. Click Add record and fill in:\nField Value Description Type SRV Record type Name _minecraft._tcp.play Format: _minecraft._tcp.(your_subdomain) Service _minecraft Auto-filled Protocol TCP Auto-filled TTL Auto Leave unchanged Priority 5 Record priority Weight 5 Record weight Port 25565 Your Minecraft server port Target play.mhcore.xyz Format: (a-record_name).(your_domain) SRV Record Fields Explained:\nName: _minecraft._tcp.play means the server will be accessible at play.mhcore.xyz Port: Specify your Minecraft server port (usually 25565 or another) Target: Should point to the A record you created (e.g., play.mhcore.xyz) Example SRV Record Configuration:\nSave the record by clicking Save.","step-by-step-instructions#Step-by-Step Instructions":"","time-for-changes-to-apply#Time for Changes to Apply":"Please note:\nDNS records may not apply instantly. Typically, changes take effect:\nCloudflare: 1-5 minutes Worldwide: from 1 hour to 48 hours (due to DNS caching) If the domain doesn’t work immediately — wait 10-15 minutes and try again.","useful-links#Useful Links":"Official Cloudflare DNS Documentation Online DNS Record Checker DNS Guide for Beginners Need help?\nIf you encounter difficulties setting up your domain, contact your hosting support or Cloudflare.","using-cname-instead-of-a-record#Using CNAME Instead of A Record":"If your hosting provides a dedicated address (e.g., server123.hosting.com), you can use a CNAME record instead of an A record:\nField Value Type CNAME Name play Target server123.hosting.com Proxy status OFF","verifying-the-configuration#Verifying the Configuration":"After creating the records, it’s recommended to verify their correctness:"},"title":"Linking a Domain to Minecraft Server"},"/en/docs/minecraft-commands/":{"data":{"advanced-administration#Advanced Administration":"Server InfoCommunicationDebug\rServer Information\rCommand Description Example help [page/command] Command reference (? as alias) help 2 publish Opens local world for LAN publish seed Shows world seed seed version Shows server version version Communication\rCommand Description Example say Broadcasts pink announcement to all say \"Server updated! Welcome!\" tell Private message to player tell Steve \"Check the new shop!\" me Describes action in third person me waves at everyone Debug \u0026 Performance\rCommand Description Example debug start/stop Starts/stops profiling debug start tps Shows server performance (TPS) tps gc Forces garbage collection gc","common-command-combinations#Common Command Combinations":"Here are some powerful command sequences that experienced administrators use:","conclusion-become-a-server-master#Conclusion: Become a Server Master":"Congratulations — you’ve just mastered the essence of Minecraft’s console arsenal! But remember: the real magic is in practice. Start small: test on a local server, experiment with command combos (like gamemode + give for creative boosts). Over time, you’ll intuitively understand how commands interweave, creating a unique experience for your community.\nIf your server grows, check out plugins like EssentialsX for expansion. For deep diving — the official wiki or fresh 1.21+ updates. Now your server isn’t just hosting — it’s a legend. Good luck building empires! 🚀\nNeed More Help?\nCheck our Troubleshooting Guide for common issues Join our Discord community for real-time support Visit our Forum for detailed discussions","console-commands-for-minecraft-server-complete-administrators-guide#Console Commands for Minecraft Server: Complete Administrator\u0026rsquo;s Guide":"Console Commands for Minecraft Server: Complete Administrator’s GuideIn the world of Minecraft, server management is not just about launching a file and watching players build their block empires. It’s an art of balance between creativity, security, and community dynamics. If you want to turn your server into a magnet for loyal players, knowledge of console commands will become your secret weapon. They allow you to instantly respond to incidents, configure gameplay, and maintain an atmosphere where every visit feels like an adventure.\nImagine: a new player complains about lag, and you save the world and restart the server with one movement. Or a suspicious user starts griefing — and they’re already on the ban list. These commands are the foundation of professional administration. We’ll break them down by categories: from basic access control to fine-tuning the world.\nImportant Notation:\nfor required parameters (e.g., ) [Square brackets] for optional additions (e.g., [reason]) In server console, commands are written without slash (/), unlike in-game chat Don’t type the brackets — they’re just for understanding Ready? Let’s dive into the Minecraft codex!","emergency-server-maintenance#Emergency Server Maintenance":"say \"Server maintenance in 5 minutes!\" save-all # Wait 5 minutes kick @a \"Server maintenance - back in 10 minutes\" stop","multiplayer-management-commands-server-console#Multiplayer Management Commands (Server Console)":"These tools are your shield and sword in the fight for order. They help filter the audience, monitor activity, and ensure stability.\nBasic ControlWhitelistBans \u0026 Kicks\rBasic Server Control\rCommand Description Example list Shows all online players. Quick activity check list save-all Force saves the entire world. Saves from losses during crashes save-all save-off Disables automatic saving (saves resources during tests) save-off save-on Re-enables auto-saving save-on stop Gracefully stops the server. Always use instead of Ctrl+C! stop Whitelist Management\rCommand Description Example whitelist add Adds to whitelist whitelist add NewFriend whitelist remove Removes from whitelist whitelist remove OldPlayer whitelist list Shows complete whitelist whitelist list whitelist on/off Enables/disables whitelist mode whitelist on whitelist reload Reloads whitelist after file edits whitelist reload Bans \u0026 Kicks\rCommand Description Example ban [reason] Adds player to blacklist ban Griefer123 \"Chat spam\" ban-ip Blocks access by IP ban-ip 192.168.1.1 kick [reason] Kicks player without ban kick TrollUser \"Server rules\" pardon Removes ban from player pardon ReformedGriefer pardon-ip Unblocks IP from blacklist pardon-ip 192.168.1.1 banlist [ips] Shows banned players or IPs banlist ips","new-player-setup#New Player Setup":"whitelist add NewPlayer tp NewPlayer SpawnArea give NewPlayer minecraft:bread 16 say \"Welcome NewPlayer to our server!\"","operator-commands-op-creative-arsenal#Operator Commands (OP): Creative Arsenal":"If you’re an OP, commands become your canvas. They allow you to change reality on the fly: from distributing treasures to teleporting to parallel dimensions. In chat, add / before the command.\nPlayer ManagementWorld ControlItems \u0026 Experience\rPlayer Management\rCommand Description Example op Grants operator rights op TrustedPlayer deop Removes operator rights deop OldAdmin gamemode [nickname] Switches game mode (s/c/a shortcuts) gamemode creative Steve defaultgamemode Sets default mode for newcomers defaultgamemode creative tp Teleports one player to another tp LostPlayer HomeBase tp Teleports to coordinates tp Steve 100 64 200 spawnpoint [nickname] [x y z] Sets spawn point spawnpoint Bob 100 64 200 World Control\rCommand Description Example difficulty Changes difficulty: 0-3 difficulty 3 time set Sets time of day (0–23999 ticks) time set day toggledownfall Toggles rain/snow toggledownfall weather Controls weather weather clear gamerule Changes game rules gamerule keepInventory true Difficulty Levels:\n0 = Peaceful 1 = Easy 2 = Normal 3 = Hard Items \u0026 Experience\rCommand Description Example give [amount] [data] Gives items give Alice diamond_sword 1 clear [item] [data] Clears inventory clear NoobPlayer 46 xp Adds/removes XP (L for levels) xp 100L DiamondMiner enchant [level] Enchants held item enchant Steve sharpness 5 Be Careful with Give Command: Some items can break the game balance. Use responsibly, especially with powerful enchanted items.","pro-tips-for-server-administrators#Pro Tips for Server Administrators":"Best Practices:\nRegular Backups: Use save-all before any major changes Monitor Activity: Check list and banlist regularly Test First: Try commands on a test server before production Document Changes: Keep a log of important administrative actions Be Consistent: Establish clear rules and enforce them fairly Security Reminders:\nOnly give OP status to trusted players Regularly review your whitelist and banlist Use stop command instead of force-closing Monitor server logs for suspicious activity","quick-reference-cards#Quick Reference Cards":"Server ManagementBasic server control, whitelist, bans and kicks\rOperator CommandsPlayer management, world control, items and experience\rAdvanced AdminServer info, communication, and debugging tools","troublemaker-management#Troublemaker Management":"tp SuspiciousPlayer AdminArea gamemode spectator SuspiciousPlayer # Investigate, then decide: ban SuspiciousPlayer \"Griefing - permanent ban\""},"title":"Minecraft Server Console Commands"},"/en/docs/minecraft-cores/":{"data":{"conclusion-choose-core-for-your-server#Conclusion: Choose Core for Your Server":"In 2025, recommendations are simple:\nFor plugin servers: Paper → Pufferfish → Purpur (by increasing complexity) For networks: Velocity (mandatory) For mods: Fabric/Quilt for new projects, NeoForge for Forge legacy For hybrids: Only Arclight, and with caution Start with test server: download from official sites (papermc.io, fabricmc.net, neoforged.net) and monitor with Spark plugin.\rAvoid outdated ones like Spigot or BungeeCord — they’re vulnerable and slow. If your project grows, invest in hosting with Aikar’s JVM flags for +20% performance.\nNow your server is ready for epic adventures! 🚀","hybrids-mod-and-plugin-combo#Hybrids: Mod and Plugin Combo":"Important Warning: Plugins on hybrids work unstably; don’t expect developer support. Risk of crashes and vulnerabilities is high.\rCore Description Recommendation Status Arclight Actively developed: supports Forge/NeoForge/Fabric mods + Bukkit plugins ✅ More stable than alternatives; for 1.21.1+ Ketting Based on Forge: supports Bukkit/Spigot/Paper plugins + Forge mods ❓ Active for new versions CatServer Similar to Ketting: Forge + limited versions with Bukkit plugins ❓ Limited version support Mohist Forge + Bukkit/Spigot/Paper plugins 💀 Outdated with security risks","minecraft-server-cores#Minecraft Server Cores":"Minecraft Server CoresIn the era of Minecraft 1.21+ and beyond, choosing a server core isn’t just a technical detail—it’s a strategic decision that determines stability, performance, and the uniqueness of your world. Imagine: your server doesn’t just host players, but creates an ecosystem where Paper optimizations accelerate thousands of connections, and Fabric mods add dimensions beyond the vanilla experience.\nBut with an abundance of forks, proxies, and hybrids, it’s easy to get confused. We’ll break down key options by categories, based on current trends in 2025: from performance focus to mod support.\nRecommendation Legend:\n✅ — Top choice for 2025 ❓ — Experimental option ❌ — Not recommended 💀 — Outdated/abandoned","mod-cores-for-deep-customization-with-mods#Mod Cores: For Deep Customization with Mods":"Mod loaders allow adding content: new blocks, biomes, mechanics. In 2025, Fabric leads in popularity thanks to fast updates.\nModernLegacy\rCurrent Loaders\rCore Description Recommendation Features Fabric Lightweight and fast modloader: quick adaptation to new versions ✅ Popular for 1.21+; easy installation, low overhead Quilt Fabric fork with improvements: more features for modders ✅ Compatible with Fabric mods; extended APIs NeoForge Forge fork without legacy mod support: focus on stability ✅ Faster than Forge; growing ecosystem Legacy Options\rCore Description Recommendation Status Forge Classic modloader with huge mod library ❓ Heavy and slow to update Tip: Choose Fabric/Quilt for fresh modpacks — they’re lighter and update faster. NeoForge — if you’re a Forge mod fan.","proxy-cores-for-server-networks-and-protection#Proxy Cores: For Server Networks and Protection":"Proxy cores connect multiple servers into a network (e.g., hub + minigames), adding load balancing and anti-DDoS. In 2025, Velocity leads due to speed and security.\nCore Description Recommendation Key Features Velocity Modern proxy from Paper team: high performance, built-in mod support (Forge/Fabric) and plugins ✅ Scalability for thousands of players; API for custom features NullCordX Paid Waterfall fork focused on antibot and DDoS protection: improved packet filtering, rate-limit ✅ (paid) Active updates, low ping; from $10/month BungeeCord Original proxy: basic but full of security holes and slow ❌ Outdated; use Waterfall as replacement Waterfall BungeeCord fork with vulnerability fixes 💀 Support discontinued; migration to Velocity mandatory Important: Velocity is the #1 choice for 2025. It’s 2-3x faster than Waterfall and supports modern features.","useful-links#Useful Links":"Paper MC - Official Paper website Fabric MC - Official Fabric website NeoForged - Official NeoForge website Velocity - Official Velocity website","vanilla-cores-foundation-for-plugins-and-optimizations#Vanilla Cores: Foundation for Plugins and Optimizations":"Vanilla cores are the foundation for Bukkit/Spigot API servers, ideal for multiplayer with plugins. They’ve evolved from simple Vanilla to high-performance forks like Paper. In 2025, the focus is on async improvements and compatibility with the latest Minecraft versions (1.21+).\nRecommendedOutdated\rTop Cores for 2025\rCore Description Recommendation Key Features Paper Spigot fork with deep optimizations: async chunk processing, dupe fixes, and support for all Bukkit/Spigot/Paper plugins ✅ High stability, paper.yml configs for fine-tuning Pufferfish Paper fork with additional patches for large servers: improved entity handling and SIMD instructions ✅ Better than Paper for 100+ players; use --add-modules=jdk.incubator.vector flag Purpur Pufferfish/Paper fork focused on customization: thousands of options in purpur.yml for changing mechanics ✅ For serious projects; inherits all optimizations + “fun” options Leaf Experimental Purpur fork with patches from multiple sources ❓ Multithreaded entity processing, but may be unstable Outdated Options\rCore Description Recommendation Why to Avoid Vanilla Original Mojang core without plugins ❌ No mod/plugin support; Paper is backward compatible CraftBukkit First core with Bukkit plugins ❌ Doesn’t support modern plugins; replaced by Spigot Spigot CraftBukkit fork with basic optimizations ❌ Lags on large servers; Paper is drop-in replacement Tip: Start with Paper — it’s free, easy to install, and covers 90% of needs. For networks with 200+ players, move to Pufferfish/Purpur."},"title":"Minecraft Server Cores"}}