{"/en/docs/":{"data":{"need-help#Need Help?":"💬 Contact Support 📧 Email Us Tip: Use the search function at the top of the page to quickly find the information you need.","qwer-host-wiki#qwer-host Wiki":"qwer-host WikiWelcome to qwer-host documentation! This is a centralized knowledge base for working with our gaming servers and web services.\nOur wiki contains detailed guides for Minecraft server administration, plugin configuration, web resource management, and technical issue resolution. All the necessary information for efficient work with our infrastructure is collected here."},"title":"Documentation"},"/en/docs/cloudflare/":{"data":{"additional-resources#Additional Resources":"Official CloudFlare Documentation CloudFlare API Documentation CloudFlare Community","available-guides#Available Guides":"This section includes the following instructions:\nLinking a Domain to Minecraft Server — how to configure A and SRV records for a beautiful server address Linking Web Server to Domain — how to connect a dynamic map or control panel via Origin Rules Disabling Encrypted Client Hello (ECH) — how to disable ECH via API for users from Russia Important: Working with the CloudFlare API requires caution. Always backup your settings and verify the correctness of the data you enter.","guides-and-instructions#Guides and Instructions":"Guides and InstructionsCloudFlare is a global content delivery network (CDN) and web security platform. In this section, you’ll find useful guides for configuring and managing your domains through CloudFlare.","main-cloudflare-features#Main CloudFlare Features":"CloudFlare provides many features:\nCDN — website acceleration through a distributed server network DDoS Protection — protection against distributed attacks SSL/TLS — free SSL certificates DNS Management — fast and reliable DNS servers Firewall — customizable security rules"},"title":"CloudFlare"},"/en/docs/cloudflare/disable-ech/":{"data":{"":"","1-request-setup#1. Request Setup":"Method: PATCH URL: https://api.cloudflare.com/client/v4/zones/{ID_ZONE}/settings/ech","2-headers-setup#2. Headers Setup":"In the Headers section, add the following fields:\nKey Value X-Auth-Email your Cloudflare email address X-Auth-Key your Global API Key Content-Type application/json","3-body-setup#3. Body Setup":"In the Body section, select raw and JSON, then enter:\n{ \"id\": \"ech\", \"value\": \"off\" }","4-send-request#4. Send Request":"Click the Send button and wait for the server response.","additional-resources#Additional Resources":"Official Cloudflare API Documentation SSL/TLS Configuration Guide for Cloudflare Cloudflare Community Need help? If you encounter difficulties disabling ECH, contact Cloudflare support or community forums.","authentication-error#Authentication Error":"Problem: Receiving Authentication error or Invalid credentials\nSolution:\nVerify your email address is correct Ensure you’ve copied the Global API Key completely Check that you haven’t added extra spaces when copying","common-issues-and-solutions#Common Issues and Solutions":"","ech-doesnt-disable#ECH Doesn\u0026rsquo;t Disable":"Problem: After executing the command, ECH remains enabled\nSolution:\nWait 10-15 minutes for changes to apply Clear the DNS cache on your device Retry the API request","global-api-key#Global API Key":"Go to the Cloudflare profile page Find the section with your Global API Key and copy the key Important: The Global API Key provides full access to your account. Never share it with third parties and store it securely!","method-1-using-curl-command#Method 1: Using curl Command":"To disable ECH, execute the following command in your terminal, replacing {ID_ZONE}, {ACCOUNT_EMAIL}, and {GLOBAL_API_KEY} with your data:\ncurl -X PATCH \"https://api.cloudflare.com/client/v4/zones/{ID_ZONE}/settings/ech\" \\ -H \"X-Auth-Email: {ACCOUNT_EMAIL}\" \\ -H \"X-Auth-Key: {GLOBAL_API_KEY}\" \\ -H \"Content-Type: application/json\" \\ --data '{\"id\":\"ech\",\"value\":\"off\"}'\rExample:\ncurl -X PATCH \"https://api.cloudflare.com/client/v4/zones/abc123def456/settings/ech\" \\ -H \"X-Auth-Email: user@example.com\" \\ -H \"X-Auth-Key: c2547eb745079dac9320b638f5e225cf483cc5cfdda41\" \\ -H \"Content-Type: application/json\" \\ --data '{\"id\":\"ech\",\"value\":\"off\"}'\rUpon successful execution, you’ll receive a JSON response confirming the setting change.","method-2-using-postman#Method 2: Using Postman":"You can execute this request through Postman by following these instructions:","method-3-for-paid-plans#Method 3: For Paid Plans":"If you’re using a paid Cloudflare plan, you can disable ECH through the dashboard interface:\nNavigate to the SSL/TLS section Open the Edge Certificates tab Find the Encrypted ClientHello (ECH) setting Set the value to Disabled Note: This option is only available for paid plan users (Pro, Business, Enterprise).","step-1-check-if-ech-is-enabled#Step 1: Check if ECH is Enabled":"Before disabling ECH, verify whether it’s enabled for your domain. You can do this using a Google Public DNS query:\nNavigate to the following link, replacing [YOUR_DOMAIN] with your domain name: https://dns.google/resolve?name=[YOUR_DOMAIN]\u0026type=HTTPS\rIf the results show that ECH is active, proceed to the next step. Example: For the domain example.com, the link would look like:\nhttps://dns.google/resolve?name=example.com\u0026type=HTTPS","step-2-obtain-cloudflare-api-credentials#Step 2: Obtain Cloudflare API Credentials":"To interact with the API, you’ll need two key elements:","step-3-disable-ech-via-cloudflare-api#Step 3: Disable ECH via Cloudflare API":"","verify-the-results#Verify the Results":"After disabling ECH, it’s recommended to verify the changes:\nWait 5-10 minutes for the settings to apply Run the Google Public DNS check again (Step 1) Check your website’s accessibility for users from Russia Done! ECH is now disabled for your domain, and the site should be accessible to Russian users.","why-disable-ech#Why Disable ECH?":"Roskomnadzor (Russian telecommunications regulator) has blocked the Encrypted Client Hello (ECH) technology, causing issues for Cloudflare users in Russia. Moreover, Cloudflare has forcibly enabled this technology for all users, including those on the free tier.\nThis guide will show you how to disable ECH for your domain using the Cloudflare API.\nFor users from Russia: Disabling ECH may be necessary to ensure your website’s accessibility for Russian users due to Roskomnadzor’s blocking of this technology.","zone-id#Zone ID":"Log in to your domain’s Cloudflare dashboard Scroll down the page in the right column Copy the Zone ID value Zone ID is the unique identifier for your domain in the Cloudflare system.","zone-id-error#Zone ID Error":"Problem: Receiving Zone not found error\nSolution:\nMake sure the Zone ID is copied correctly Verify you’re using the Zone ID for the domain you want to modify"},"title":"Disabling Encrypted Client Hello (ECH)"},"/en/docs/cloudflare/domain-setup/":{"data":{"-cloudflare-shows-error-when-creating-record#❌ Cloudflare shows error when creating record":"Cause: Incorrect data format\nSolution:\nEnsure Target ends with . or contains a fully qualified domain name Check that all required fields are filled Use only allowed characters (a-z, 0-9, hyphen, period)","-error-connection-via-domain-works-but-with-wrong-port#❌ Error: Connection via domain works but with wrong port":"Cause: SRV record is misconfigured or missing\nSolution:\nCheck for the presence of an SRV record Ensure the port is specified correctly Verify the Name format: _minecraft._tcp.(subdomain)","-error-unknown-host#❌ Error: \u0026ldquo;Unknown host\u0026rdquo;":"Causes:\nDNS records haven’t propagated yet Error in A record configuration Proxy Status is enabled (orange cloud) Solution:\nCheck that Proxy Status is disabled for the A record Wait 15-30 minutes Clear DNS cache on your computer: Windows: ipconfig /flushdns macOS: sudo dscacheutil -flushcache Linux: sudo systemd-resolve --flush-caches","additional-capabilities#Additional Capabilities":"","common-errors-and-solutions#Common Errors and Solutions":"","how-to-use-your-domain-instead-of-an-ip-address#How to Use Your Domain Instead of an IP Address?":"How to Use Your Domain Instead of an IP Address?Linking a domain to your server is necessary to make the connection process simpler and faster. Typically, an IP address is used for connection, which can be long and difficult to remember (123.45.67.89:1234).\nIf you link a domain, for example, play.mhcore.xyz, it will be easier for players to remember, which can help attract an audience to your server.\nWhy do you need this?\nEasy to remember: play.mhcore.xyz instead of 123.45.67.89:25565 Professional appearance for your server Ability to change hosting without changing the address for players","method-1-setup-via-a-record-recommended#Method 1: Setup via A Record (Recommended)":"","method-2-setup-without-a-record-alternative#Method 2: Setup Without A Record (Alternative)":"If your server is hosted on MHCore, you can use the node address directly:","multiple-servers-on-one-domain#Multiple Servers on One Domain":"You can create multiple subdomains for different servers:\nplay.mhcore.xyz — main server lobby.mhcore.xyz — lobby server creative.mhcore.xyz — creative mode minigames.mhcore.xyz — mini-games For each, create separate A and SRV records with different names and ports!","preparation#Preparation":"Important to remember!\nTo begin, you need to:\nPurchase a domain (for example, on Namecheap, GoDaddy, REG.RU, etc.) Transfer it to Cloudflare (free, but mandatory for this guide) If you already have a domain in Cloudflare — proceed to the next step!","result#Result":"According to the example above, your server will be accessible at:\nplay.mhcore.xyz\rPlayers will be able to connect to the server by simply entering this address in Minecraft, without specifying the port!\nDone! 🎉\nNow players can connect to your server using a beautiful and memorable address!","step-1-open-cloudflare-dashboard#Step 1: Open Cloudflare Dashboard":"Go to Cloudflare Log in to your account You will see a list of all your domains","step-2-select-your-domain#Step 2: Select Your Domain":"From the list of domains, select the one you want to use for your Minecraft server.","step-3-navigate-to-the-dns-tab#Step 3: Navigate to the \u0026ldquo;DNS\u0026rdquo; Tab":"In the top menu, find and click on DNS → Records.","step-4-alternative-create-only-srv-record#Step 4 (alternative): Create Only SRV Record":"Field Value Type SRV Name _minecraft._tcp.play Priority 5 Weight 5 Port 25565 (your server port) Target node1.mhcore.xyz (your node name) For MHCore Users: In Target, specify your node address in the format: (node_name).mhcore.xyz\nExample: node1.mhcore.xyz, node2.mhcore.xyz, etc.","step-4-create-a-new-a-record#Step 4: Create a New A Record":"Click the Add record button and fill in the fields as follows:\nField Value Description Type A Record type Name play Any name (subdomain) IPv4 address 123.45.67.89 Your server’s IP address WITHOUT PORT Proxy status 🔴 OFF Orange cloud must be disabled (gray) TTL Auto Leave unchanged Critically important:\nProxy Status (orange cloud) MUST be disabled! In IPv4, specify the IP WITHOUT PORT (e.g., 123.45.67.89, not 123.45.67.89:25565) Example A Record Configuration:\nSave the record by clicking Save.","step-5-create-a-new-srv-record#Step 5: Create a New SRV Record":"Now create an SRV record to specify the server port. Click Add record and fill in:\nField Value Description Type SRV Record type Name _minecraft._tcp.play Format: _minecraft._tcp.(your_subdomain) Service _minecraft Auto-filled Protocol TCP Auto-filled TTL Auto Leave unchanged Priority 5 Record priority Weight 5 Record weight Port 25565 Your Minecraft server port Target play.mhcore.xyz Format: (a-record_name).(your_domain) SRV Record Fields Explained:\nName: _minecraft._tcp.play means the server will be accessible at play.mhcore.xyz Port: Specify your Minecraft server port (usually 25565 or another) Target: Should point to the A record you created (e.g., play.mhcore.xyz) Example SRV Record Configuration:\nSave the record by clicking Save.","step-by-step-instructions#Step-by-Step Instructions":"","time-for-changes-to-apply#Time for Changes to Apply":"Please note:\nDNS records may not apply instantly. Typically, changes take effect:\nCloudflare: 1-5 minutes Worldwide: from 1 hour to 48 hours (due to DNS caching) If the domain doesn’t work immediately — wait 10-15 minutes and try again.","useful-links#Useful Links":"Official Cloudflare DNS Documentation Online DNS Record Checker DNS Guide for Beginners Need help?\nIf you encounter difficulties setting up your domain, contact your hosting support or Cloudflare.","using-cname-instead-of-a-record#Using CNAME Instead of A Record":"If your hosting provides a dedicated address (e.g., server123.hosting.com), you can use a CNAME record instead of an A record:\nField Value Type CNAME Name play Target server123.hosting.com Proxy status OFF"},"title":"Linking a Domain to Minecraft Server"},"/en/docs/cloudflare/web-server-setup/":{"data":{"-error-521-web-server-is-down#❌ Error 521 \u0026ldquo;Web server is down\u0026rdquo;":"Cause: Cloudflare cannot connect to your server\nSolution:\nCheck that the web server is running Ensure the port is open in the firewall Verify the IP address in the A record is correct Make sure the port in Origin Rule is specified correctly","-error-522-connection-timed-out#❌ Error 522 \u0026ldquo;Connection timed out\u0026rdquo;":"Cause: Cloudflare cannot reach the server within the allotted time\nSolution:\nCheck server accessibility from outside (via online port scanners) Make sure the port is not blocked by the provider Check firewall settings on the server","-infinite-loading-or-too-many-redirects#❌ Infinite loading or \u0026ldquo;Too many redirects\u0026rdquo;":"Cause: Incorrect SSL/TLS settings\nSolution:\nGo to SSL/TLS → Overview Set mode to Flexible (if your server doesn’t use HTTPS) Or set to Full (if your server uses a self-signed certificate)","-page-opens-but-stylesscripts-dont-load#❌ Page opens but styles/scripts don\u0026rsquo;t load":"Cause: Mixed Content — HTTPS page loading HTTP resources\nSolution:\nGo to SSL/TLS → Edge Certificates Enable Always Use HTTPS Enable Automatic HTTPS Rewrites","benefits-of-using-cloudflare#Benefits of Using Cloudflare":"✅ Free SSL — automatic HTTPS for your site\n✅ DDoS protection — protection against attacks\n✅ Caching — faster loading of static files\n✅ CDN — your site will load faster worldwide\n✅ IP hiding — your server’s real IP address will be hidden\n✅ Analytics — free visitor statistics","common-issues-and-solutions#Common Issues and Solutions":"","example-1-dynmap-for-minecraft-server#Example 1: Dynmap for Minecraft Server":"Domain: map.mhcore.xyz\rIP: 123.45.67.89\rDynmap Port: 8123\rA Record:\r- Name: map\r- IP: 123.45.67.89\r- Proxy: ON\rOrigin Rule:\r- URL Full wildcard https://map.mhcore.xyz/*\r- Rewrite to port 8123\rResult: https://map.mhcore.xyz will show your Dynmap!","example-2-pterodactyl-control-panel#Example 2: Pterodactyl Control Panel":"Domain: panel.mhcore.xyz\rIP: 123.45.67.89\rPanel Port: 8080\rA Record:\r- Name: panel\r- IP: 123.45.67.89\r- Proxy: ON\rOrigin Rule:\r- URL Full wildcard https://panel.mhcore.xyz/*\r- Rewrite to port 8080\rResult: https://panel.mhcore.xyz will open the control panel!","fill-in-the-rule-form#Fill in the rule form:":"Rule name:\nDynmap Port Forwarding\r(or any other name that makes sense to you)\nWhen incoming requests match… (Condition):\nSelect:\nField: URL Full Operator: wildcard Value: https://map.mhcore.xyz/* (your subdomain with A record) Then… (Action):\nIn the Destination Port section, select:\nRewrite to: 25443 (specify your web server’s port) Fill-in example:","how-to-link-a-dynamic-mapother-web-server-to-a-domain#How to Link a Dynamic Map/Other Web Server to a Domain?":"How to Link a Dynamic Map/Other Web Server to a Domain?If you have a web server (for example, a Minecraft dynamic map via Dynmap, BlueMap, or a server Panel), you can easily link it to your domain through Cloudflare. This takes literally a couple of clicks!\nWhat can be linked to a domain:\n🗺️ Dynamic maps (Dynmap, BlueMap, Pl3xMap) 🎮 Server control panels (Pterodactyl, Multicraft) 🌐 Websites on your server 📊 Monitoring and statistics 🔧 Any other web service on your port","how-to-transfer-domain-to-cloudflare#How to Transfer Domain to Cloudflare?":"If you don’t have a domain on Cloudflare yet, you need to transfer it first:","multiple-web-services-on-one-domain#Multiple Web Services on One Domain":"You can create multiple subdomains for different services:","quick-guide#Quick Guide:":"Register on Cloudflare (free) Add your domain — click “Add Site” and enter your domain Choose a plan — select the free plan (Free) Cloudflare will show your current DNS records — review and confirm Change NS servers at your registrar — Cloudflare will show 2 NS server addresses Log in to your registrar’s website (where you bought the domain) and replace NS servers with those provided by Cloudflare Wait — DNS servers will update within 24-48 hours (usually faster) Detailed domain transfer instructions:\nOfficial Cloudflare Documentation Video tutorial on YouTube","ssltls-configuration#SSL/TLS Configuration":"For correct web server operation through Cloudflare, configure SSL:\nGo to SSL/TLS → Overview Choose the appropriate mode: Mode When to Use Flexible Your server uses only HTTP (no SSL) Full Your server uses HTTPS with self-signed certificate Full (strict) Your server uses HTTPS with trusted certificate Recommendation: For most cases (Dynmap, simple web servers), use Flexible mode.","step-1-create-an-a-record-with-proxying#Step 1: Create an A Record with Proxying":"Open Cloudflare dashboard Select your domain Go to DNS → Records Click Add record Fill in the fields:\nField Value Description Type A Record type Name map Subdomain (you can choose any: map, dynmap, web, panel, etc.) IPv4 address 123.45.67.89 Your server’s IP address Proxy status 🟠 ON Orange cloud must be enabled! TTL Auto Leave unchanged Important difference from Minecraft server setup:\nFor a web server, Proxy Status (orange cloud) must be ENABLED (orange)!\nThis allows using Cloudflare features, including port proxying.\nConfiguration example:\nClick Save.","step-2-configure-origin-rules-for-port-forwarding#Step 2: Configure Origin Rules for Port Forwarding":"Now you need to set up a rule that will redirect requests to the required port of your web server.\nIn Cloudflare dashboard, go to Rules → Overview Click Create rule Select Origin rule","step-3-save-and-deploy-the-rule#Step 3: Save and Deploy the Rule":"Review all settings Click Deploy Cloudflare will apply the rule automatically Done! Now your web server is accessible at:\nhttps://map.mhcore.xyz\rNote: Cloudflare will automatically add HTTPS (SSL certificate), even if your server uses only HTTP!","step-4-verify-functionality#Step 4: Verify Functionality":"Open a browser Navigate to your subdomain address (e.g., https://map.mhcore.xyz) You should see your dynamic map or web interface! Please note:\nFirst connection may take a few seconds SSL certificate is created automatically and for free Cloudflare will cache static files to speed up loading","step-by-step-web-server-linking-guide#Step-by-Step Web Server Linking Guide":"","structure-example#Structure Example:":"Subdomain Service Port Origin Rule map.mhcore.xyz Dynmap 8123 URL Full wildcard map.mhcore.xyz → Port 8123 bluemap.mhcore.xyz BlueMap 8100 URL Full wildcard bluemap.mhcore.xyz → Port 8100 panel.mhcore.xyz Pterodactyl 8080 URL Full wildcard panel.mhcore.xyz → Port 8080 stats.mhcore.xyz Statistics 3000 URL Full wildcard stats.mhcore.xyz → Port 3000 For each service:\nCreate a separate A record with proxying enabled Create a separate Origin Rule with the corresponding port","usage-examples#Usage Examples":"","useful-links#Useful Links":"Official Cloudflare Rules Documentation Cloudflare SSL/TLS Configuration Troubleshooting Cloudflare Errors Need help?\nIf you encounter difficulties setting up a web server through Cloudflare, contact your hosting support or Cloudflare community forums."},"title":"Linking Web Server to Domain"},"/en/docs/minecraft-commands/":{"data":{"advanced-administration#Advanced Administration":"Server InfoCommunicationDebug\rServer Information\rCommand Description Example help [page/command] Command reference (? as alias) help 2 seed Shows world seed seed version Shows server version version Communication\rCommand Description Example say Broadcasts pink announcement to all say \"Server updated! Welcome!\" tell Private message to player tell qwerhost \"Best host qwerhost!\" Debug \u0026 Performance\rCommand Description Example tps Shows server performance (TPS) tps","conclusion#Conclusion":"Congratulations — you’ve just mastered the Minecraft console! But remember: the real magic is in practice. Start small: test on a local server, experiment. Over time you’ll memorize them.\nIf your server grows, check out plugins like EssentialsX for expansion. For deep diving — the official wiki, plugins.\nNeed More Help?\nJoin our Discord community for real-time support","console-commands-for-minecraft-server-complete-administrators-guide#Console Commands for Minecraft Server: Complete Administrator\u0026rsquo;s Guide":"Console Commands for Minecraft Server: Complete Administrator’s GuideIn the world of Minecraft, server management is not just about launching a file and watching players build their block empires. It’s an art of balance between creativity, security, and community dynamics. If you want to turn your server into a magnet for loyal players, knowledge of console commands will become your secret weapon. They allow you to instantly respond to incidents, configure gameplay, and maintain an atmosphere where every visit feels like an adventure.\nImagine: a new player complains about lag, and you save the world and restart the server with one movement. Or a suspicious user starts griefing — and they’re already on the ban list. These commands are the foundation of professional administration. We’ll break them down by categories: from basic access control to fine-tuning the world.\nImportant Notation:\nfor required parameters (e.g., ) [Square brackets] for optional additions (e.g., [reason]) In server console, commands are written without slash (/), unlike in-game chat Don’t type the brackets — they’re just for understanding Ready? Let’s dive into the Minecraft codex!","multiplayer-management-commands-server-console#Multiplayer Management Commands (Server Console)":"These tools are your shield and sword in the fight for order. They help filter the audience, monitor activity, and ensure stability.\nBasic ControlWhitelistBans \u0026 Kicks\rBasic Server Control\rCommand Description Example list Shows all online players on the server list save-all Force saves the entire world. Saves from losses during crashes save-all save-off Disables automatic saving (saves resources during tests) save-off save-on Re-enables auto-saving save-on stop Instantly stops the server stop Whitelist Management\rCommand Description Example whitelist add Adds to whitelist whitelist add NewFriend whitelist remove Removes from whitelist whitelist remove OldPlayer whitelist list Shows complete whitelist whitelist list whitelist on/off Enables/disables whitelist mode whitelist on whitelist reload Reloads whitelist after file edits whitelist reload Bans \u0026 Kicks\rCommand Description Example ban [reason] Adds player to server blacklist ban Griefer123 \"Chat spam\" ban-ip Blocks access by IP to server ban-ip 192.168.1.1 kick [reason] Kicks player from server kick TrollUser \"Server rules\" pardon Removes player block pardon ReformedGriefer pardon-ip Unblocks IP from blacklist pardon-ip 192.168.1.1 banlist Shows list of banned players banlist","operator-commands-op-creative-arsenal#Operator Commands (OP): Creative Arsenal":"If you’re an OP, you become the king of the server. They allow you to partially manage the server: from distributing items, adding to the list to blocking bad players. In chat, add / before the command.\nPlayer ManagementWorld ControlItems \u0026 Experience\rPlayer Management\rCommand Description Example op Grants operator rights op qwerhost deop Removes operator rights deop qwerhost gamemode [nickname] Switches game mode (s/c/a shortcuts) gamemode creative qwerhost tp Teleports one player to another tp qwerhost qwerty1234 tp Teleports to coordinates tp qwerhost 100 64 200 spawnpoint [nickname] [x y z] Sets spawn point spawnpoint qwerhost 100 64 200 World Control\rCommand Description Example difficulty Changes difficulty: 0-3 difficulty 3 time set Sets time of day (0–23999 ticks) time set day weather Controls weather weather clear gamerule Changes game rules gamerule keepInventory true Difficulty Levels:\n0 = Peaceful 1 = Easy 2 = Normal 3 = Hard Items \u0026 Experience\rCommand Description Example give [amount] Gives items give qwerhost diamond_sword 1 clear Clears inventory clear qwerhost Be Careful with Give Command: Some items can break the game balance. Use responsibly, especially with powerful enchanted items.","pro-tips-for-server-administrators#Pro Tips for Server Administrators":"Best Practices:\nRegular Backups: Use save-all before any major changes Monitor Activity: Check list and banlist regularly Test First: Try commands on a test server before production Document Changes: Keep a log of important administrative actions Be Consistent: Establish clear rules and enforce them fairly Security Reminders:\nOnly give OP status to trusted players Regularly review your whitelist and banlist Use stop command instead of force-closing Monitor server logs for suspicious activity","quick-reference-cards#Quick Reference Cards":"Server ManagementBasic server control, whitelist, bans and kicks\rOperator CommandsPlayer management, world control, items and experience\rAdvanced AdministrationServer info, communication and debugging tools"},"title":"Minecraft Server Console Commands"},"/en/docs/minecraft-cores/":{"data":{"":"In the era of Minecraft 1.21+ and beyond, choosing a server core isn’t just a technical detail—it’s a strategic decision that determines stability, performance, and the uniqueness of your world.\nBut with an abundance of forks, proxies, and hybrids, it’s easy to get confused. We’ll break down key options by categories, based on current trends in 2025: from performance focus to mod support.\nRecommendation Legend:\n✅ — Top choice for 2025 ❓ — Experimental option ❌ — Not recommended 💀 — Outdated/abandoned","conclusion-choose-core-for-your-server#Conclusion: Choose Core for Your Server":"In 2025, recommendations are simple:\nFor plugin servers: Paper → Pufferfish → Purpur (by increasing complexity) For networks: Velocity For mods: Fabric/Quilt for new projects, NeoForge for Forge legacy For hybrids: Arclight, Mohist with caution Start with test server: download from official sites (papermc.io, fabricmc.net, neoforged.net) and monitor with Spark plugin.\rAvoid outdated ones like Spigot or BungeeCord — they’re vulnerable and slow. If your project grows, invest in hosting with Aikar’s JVM flags for +20% performance.\nNow your server is ready to work! 🚀","hybrids-mod-and-plugin-combo#Hybrids: Mod and Plugin Combo":"Important Warning: Plugins on hybrids work unstably; don’t expect developer support. Risk of crashes and vulnerabilities is high.\rCore Description Recommendation Status Arclight Actively developed: supports Forge/NeoForge/Fabric mods + Bukkit plugins ✅ More stable than alternatives; for 1.21.1+ Ketting Based on Forge: supports Bukkit/Spigot/Paper plugins + Forge mods ❓ Active for new versions CatServer Similar to Ketting: Forge + limited versions with Bukkit plugins ❓ Limited version support Mohist Forge + Bukkit/Spigot/Paper plugins 💀 Outdated with security risks","mod-cores-for-deep-customization-with-mods#Mod Cores: For Deep Customization with Mods":"Mod loaders allow adding content: new blocks, biomes, mechanics. In 2025, Fabric leads in popularity thanks to fast updates.\nModernLegacy\rCurrent Loaders\rCore Description Recommendation Features Fabric Lightweight and fast modloader: quick adaptation to new versions ✅ Popular for 1.21+; easy installation, low overhead Quilt Fabric fork with improvements: more features for modders ✅ Compatible with Fabric mods; extended APIs NeoForge Forge fork without legacy mod support: focus on stability ✅ Faster than Forge; growing ecosystem Legacy Options\rCore Description Recommendation Status Forge Classic modloader with huge mod library ❓ Heavy and slow to update Tip: Choose Fabric/Quilt for fresh modpacks — they’re lighter and update faster. NeoForge — if you’re a Forge mod fan.","proxy-cores-for-server-networks-and-protection#Proxy Cores: For Server Networks and Protection":"Proxy cores connect multiple servers into a network (e.g., hub + minigames), adding load balancing and anti-DDoS. In 2025, Velocity leads due to speed and security.\nCore Description Recommendation Key Features Velocity Modern proxy from Paper team: high performance, built-in mod support ✅ Scalability for thousands of players; API for custom features NullCordX Paid Waterfall fork focused on antibot and DDoS protection ✅ (paid) Active updates, low ping; from $10/month BungeeCord Original proxy: basic but full of security holes ❌ Outdated; use Waterfall as replacement Waterfall BungeeCord fork with vulnerability fixes 💀 Support discontinued; migration to Velocity Important: Velocity is the #1 choice for 2025. It’s 2-3x faster than Waterfall and supports modern features.","useful-links#Useful Links":"Paper MC - Official Paper website Fabric MC - Official Fabric website NeoForged - Official NeoForge website Velocity - Official Velocity website","vanilla-cores-foundation-for-plugins-and-optimizations#Vanilla Cores: Foundation for Plugins and Optimizations":"Vanilla cores are the foundation for Bukkit/Spigot API servers, ideal for multiplayer with plugins. They’ve evolved from simple Vanilla to high-performance forks like Paper. In 2025, the focus is on async improvements and compatibility with the latest Minecraft versions (1.21+).\nRecommendedOutdated\rTop Cores for 2025\rCore Description Recommendation Key Features Paper Spigot fork with deep optimizations: async chunk processing, dupe fixes, and support for all Bukkit/Spigot/Paper plugins ✅ High stability, paper.yml configs for fine-tuning Pufferfish Paper fork with additional patches for large servers: improved entity handling and SIMD instructions ✅ Better than Paper for 100+ players; use --add-modules=jdk.incubator.vector flag Purpur Pufferfish/Paper fork focused on customization: thousands of options in purpur.yml for changing mechanics ✅ For serious projects; inherits all optimizations + “fun” options Leaf Experimental Purpur fork with patches from multiple sources ❓ Multithreaded entity processing, but may be unstable Outdated Options\rCore Description Recommendation Why to Avoid Vanilla Original Mojang core without plugins ❌ No mod/plugin support; Paper is backward compatible CraftBukkit First core with Bukkit plugins ❌ Doesn’t support modern plugins; replaced by Spigot Spigot CraftBukkit fork with basic optimizations ❌ Lags on large servers; Paper is drop-in replacement Tip: Start with Paper — it’s free, easy to install, and covers 90% of needs. For networks with 200+ players, move to Pufferfish/Purpur."},"title":"Minecraft Server Cores"},"/en/docs/server-setup/allow-offline-auth/":{"data":{"":"If you intentionally want to allow cracked/offline clients to connect, follow these steps. Remember: this increases security risks and can let malicious users impersonate admins — follow the steps carefully.\nOpen panel.qwer-host.xyz and select your server. Go to the “Files” tab and open server.properties. Find the line online-mode=true and change it to online-mode=false. Save the file. Restart the server. IMPORTANT:\nYOU MUST INSTALL AN AUTHENTICATION PLUGIN (e.g., AuthMe, xAuth or another trusted plugin). Without it, anyone can join with any nickname — including admin names — and perform any actions. Use a whitelist and manage permissions via trusted permission plugins (such as LuckPerms). Make backups before making changes. While this setting allows non-premium players to join, we strongly recommend purchasing legitimate licenses for all players and using offline-mode only when absolutely necessary."},"title":"Allowing Offline (Cracked) Clients"},"/en/docs/server-setup/auto-restart/":{"data":{"":"","1-open-the-task-scheduler#1. Open the Task Scheduler":"Go to the “Schedules” tab in the hosting control panel at panel.qwer-host.xyz and create a new schedule.","2-create-a-schedule#2. Create a Schedule":"Choose a name for the schedule and configure the execution time. The schedule in the screenshot below will run at 4:00 AM.","3-add-a-notification-task-optional#3. Add a Notification Task (Optional)":"If you want to notify players before the restart, create a notification task.\nClick on “New Task”:\nConfigure the task to send a chat message:","4-create-a-server-restart-task#4. Create a Server Restart Task":"Create a task for the actual server restart. Select the “Restart Server” action.","5-done#5. Done!":"Now the server will automatically restart every day at 04:00 (or at the time you configured).","additional-recommendations#Additional Recommendations":"Choose a restart time when the server has minimal players (usually nighttime hours). Use a notification task 5-10 minutes before the restart so players have time to prepare. Regular restarts (1-2 times per day) help maintain stable server performance and avoid lag. If you have questions or issues, contact technical support.","step-by-step-instructions#Step-by-Step Instructions":"","why-are-automatic-restarts-needed#Why Are Automatic Restarts Needed?":"We often receive support requests asking: “How do I set up automatic Minecraft server restarts?” We listen to our clients, and that’s why we’ve prepared this tutorial for you.\nImportant: Regularly restarting your Minecraft server is necessary to avoid excessive load and RAM overflow."},"title":"Automatic Minecraft Server Restarts with World Saving"},"/en/docs/server-setup/backups/":{"data":{"":"","1-open-the-backups-section#1. Open the Backups Section":"Go to the “Backups” section in your server control panel.","2-create-a-backup#2. Create a Backup":"Click the “Create Backup” button.","3-configure-backup-settings#3. Configure Backup Settings":"Choose a name for the backup and click “Start Backup”.\nImportant! Creating a backup will immediately stop your server. Plan backup creation for times when there are minimal players on the server.","4-protection-against-accidental-deletion-optional#4. Protection Against Accidental Deletion (Optional)":"You can protect the backup from accidental deletion using the toggle at the bottom of the backup creation form.","backup-best-practices#Backup Best Practices":"Regularity — create backups regularly (daily or weekly depending on server activity) Planning — use automatic restart scheduling to create backups during off-hours Naming — give backups clear names with dates and descriptions (e.g., “backup-2025-10-23-before-update”) Verification — periodically check that backups are being created correctly Storage — don’t delete old backups immediately — keep several recent copies just in case","creating-a-backup-through-control-panel#Creating a Backup Through Control Panel":"Our website panel.qwer-host.xyz provides the ability to create backups directly in the control panel.","how-to-protect-yourself#How to Protect Yourself?":"That’s what backups are for! With their help, you can easily restore all data and continue enjoying the game.","restoring-from-a-backup#Restoring From a Backup":"If you need to restore your server from a backup:\nGo to the “Backups” section Find the needed backup in the list Click the three dots to the right of the backup Select “Restore” Confirm the action Restoring from a backup will replace all current server files with data from the backup copy. Make sure you selected the correct backup!\rRegular backups are a guarantee of your project’s safety. Don’t neglect this feature!","step-by-step-instructions#Step-by-Step Instructions":"","why-are-backups-so-important#Why Are Backups So Important?":"A backup (data copy) is essential for any Minecraft server that aims to become an interesting project.\nImagine this situation: you created a server, installed many different plugins and interesting mods, spent days on configuration, and also built survival houses. And then… a sudden error, some failure, or someone deliberately harmed your project — and everything is lost.\nThis happens very often, and all the players’ efforts go to waste. People lose motivation and don’t want to do anything anymore."},"title":"How to Create Minecraft Server Backups Through Control Panel"},"/en/docs/server-setup/eula/":{"data":{"":"","how-to-accept-eula#How to Accept EULA?":"There are two ways to accept the license agreement:","important-information#Important Information":"By accepting the EULA, you agree to comply with Mojang Studios’ license agreement terms We recommend reading the full agreement at: minecraft.net/eula EULA applies to all Minecraft servers, regardless of hosting provider","method-1-through-console-recommended#Method 1: Through Console (Recommended)":"Go to your server console in the control panel Start the server The server will automatically create an eula.txt file and stop Follow the instructions in the console or use Method 2","method-2-edit-the-eulatxt-file#Method 2: Edit the eula.txt File":"Open the control panel at panel.qwer-host.xyz and select your server Go to the “Files” tab Find and open the eula.txt file Replace the file contents with: eula=true\rSave the file Start the server After completing these steps, the server will start successfully.","what-is-eula#What is EULA?":"EULA (End User License Agreement) is an end-user license agreement between you and the Minecraft developer (Mojang Studios).\nEULA describes:\nRules for using the game User rights and responsibilities Restrictions on modifications and commercial use Warning! Without accepting the EULA, starting a Minecraft server is impossible."},"title":"EULA — Minecraft License Agreement"},"/en/docs/server-setup/high-ping-issue/":{"data":{"":"","1-download-winmtr#1. Download WinMTR":"Download WinMTR from the official repository: WinMTR Releases","2-run-the-trace#2. Run the Trace":"Important: Disable all VPN, PROXY, and similar services before starting the trace\nIn the “Host” field of WinMTR, enter only the IP address of your server, without the port\nExample: If the server address is 192.168.1.1:27015, enter only 192.168.1.1","3-collect-data#3. Collect Data":"Click the “Start” button to begin the trace Wait 2-3 minutes to collect statistics for each node on the path to the server Click the “Stop” button to stop the test Save the results by clicking “Export TXT”","4-find-your-external-ip-address#4. Find Your External IP Address":"You can find your external IP address on any IP detection service, for example: 2ip.ru","additional-tips#Additional Tips":"Advise players to check the stability of their internet connection Verify that the server is not overloaded (CPU, RAM, disk) Ensure optimized plugins and settings are installed on the server","common-causes#Common Causes":"Before proceeding with diagnostics, check the following common causes of high ping:\nUnloaded chunks — ensure the server can handle chunk loading properly Paper AntiXray in mode 2 or 3 — these modes can create additional load. Try switching to mode 1 or disabling it If fixing these causes doesn’t help, proceed to the next step.","contacting-technical-support#Contacting Technical Support":"After completing these steps, create a support ticket and provide the following data:\nWinMTR trace result (.txt file) Player’s IP address corresponding to the trace result Description of the issue and the time when high ping was observed Our support team will analyze the data and help resolve the issue.","diagnostics-with-winmtr#Diagnostics with WinMTR":"","instructions-for-players#Instructions for Players":"Ask all players experiencing high ping to follow these steps:","problem#Problem":"Are players experiencing high ping on your server? Don’t worry — we’ll help you diagnose and solve this issue.","what-is-winmtr#What is WinMTR?":"WinMTR is a free, open-source utility that combines the functionality of traceroute and ping, providing detailed information about network packet routing."},"title":"Players Have High Ping — What to Do?"},"/en/docs/server-setup/invalid-signature-error/":{"data":{"":"","problem-description#Problem Description":"If you encounter this error when trying to connect to a server:\nInvalid signature for profile public key.\rTry restarting your game.\ragj$a: Missing profile public key.\rThis server requires secure profiles.\rThis is related to secure profile verification in newer Minecraft versions. Here’s the solution!","solution#Solution":"You need to change a setting in the server configuration file server.properties.","step-by-step-instructions#Step-by-Step Instructions":"Open the control panel at panel.qwer-host.xyz and select your server. Go to the “Files” tab and find the server.properties file. Open the file for editing. Find the line: enforce-secure-profile=true\rChange the value to false: enforce-secure-profile=false\rSave the file. Restart the server. After the restart, try connecting again — the error should be gone."},"title":"Invalid signature for profile public key — How to Fix?"},"/en/docs/server-setup/mysql/":{"data":{"":"","connecting-a-database-to-a-plugin#Connecting a Database to a Plugin":"Now let’s move on to connecting the database to a plugin. As an example, we will use the CoreProtect plugin.\nGo to the Files tab in the plugin directory (plugins/CoreProtect).\nOpen config.yml.\nFind the data storage settings. First, you need to enable MySQL support in the plugin. In this case, you need to set use-mysql: true\nCopy the necessary information into the corresponding fields. It is recommended to put the password in quotes \" \", as it may contain special characters. Also pay attention to the database name - it must exactly match the value from the panel. Save the config and restart the server.","creating-a-database#Creating a Database":"To create a database:\nGo to the server control panel.\nNavigate to the “Databases” tab.\nCreate a new database and come up with a name for it according to the plugin you are going to use it for.\nClick on the “eye” icon to see the database parameters. Done! You have created a database.","what-are-mysql-databases-for-and-how-to-use-them#What are MySQL databases for and how to use them?":"MySQL databases are used to store plugin data and synchronize data between servers in a network. Data stored in the database does not take up space on the server disk.","working-with-other-plugins#Working with Other Plugins":"Other plugins work the same way, but there are some exceptions where databases are placed in a separate .yml file. Everything is done logically - just look for a place where you need to enter the fields that are given to you in the control panel."},"title":"MySQL (Databases)"},"/en/docs/server-setup/top-errors/":{"data":{"":"","1-choosing-the-wrong-plan#1. Choosing the wrong plan":"This is the most common mistake among beginners. To keep the server stable and avoid overload, choose a plan that fits your load. For example, to run a server comfortably without plugins on version 1.20.2, you need at least 2 GB of RAM.","2-installing-a-huge-number-of-modsplugins#2. Installing a huge number of mods/plugins":"If you install too many plugins or mods, don’t be surprised when something breaks. Plugins can conflict and cause errors. If you plan to add many additions, proceed carefully and be prepared to buy more resources.","3-ignoring-console-errors#3. Ignoring console errors":"You must check the console for errors and warnings. Sometimes something may crash or throw an error related to a component. Read the error, identify the plugin mentioned, and search the web. In 99% of cases a solution exists. If it’s a warning, translate it and take notice.","4-not-using-the-knowledge-base-and-asking-repeated-questions-to-support#4. Not using the knowledge base and asking repeated questions to support":"Learn to google and check our knowledge base. Almost every basic (and not so basic) question has an answer. Learn and understand how things work.","5-copying-servers-as-is#5. Copying servers \u0026ldquo;as is\u0026rdquo;":"Copying server setups or downloading ready-made packs while only renaming them is short-sighted. Before creating a server, have a unique idea or concept — that will help your project grow.","6-ignoring-backups#6. Ignoring backups":"Never neglect backups. Regular snapshots will save you from crashes, corrupted worlds, or plugin update issues.","7-updating-plugins-and-server-without-testing#7. Updating plugins and server without testing":"Updates can break compatibility. Always test new plugin or server versions on a local or staging server before applying them to production.","8-poor-security-configuration#8. Poor security configuration":"Leaving default passwords, not setting proper access rights, or opening unnecessary ports makes your server vulnerable. Configure operator permissions and use strong passwords.","9-incorrect-java-optimization-and-settings#9. Incorrect Java optimization and settings":"Improper Java startup parameters (heap, garbage collection) and lack of configuration optimization can cause lag and memory leaks. Follow recommendations for your server version and use proven startup templates.\nIf you have questions, contact our support or check the help section.","want-to-start-your-own-minecraft-server-and-learn-how-to-manage-it-properly#Want to start your own Minecraft server and learn how to manage it properly?":"Read this article, watch our video, and NEVER repeat these mistakes. Unfortunately, even experienced players sometimes struggle with their servers and blame the hosting. But the responsibility is on your shoulders — and in the video we explain why!"},"title":"Top Mistakes When Creating a Minecraft Server"}}