{"/about/":{"data":{"":"Hextra разработана как простая, быстрая и гибкая тема для создания современных статических сайтов. Она особенно хорошо подходит для сайтов документации, но также может использоваться для различных типов сайтов, таких как блоги, портфолио и многое другое.\nHugo, как и Jekyll, является генератором статических сайтов. Что отличает Hugo, так это то, что это единый бинарный файл, что делает его легким в установке и запуске на различных платформах. Он также чрезвычайно быстрый и надежный, способный рендерить сайт с тысячами страниц за миллисекунды.\nHextra построена с учетом минимального воздействия. Для начала не требуется дополнительных зависимостей, таких как пакеты Node.js; все, что вам нужно, это один файл конфигурации YAML вместе с вашим контентом Markdown. Таким образом, мы можем сосредоточиться на написании качественного контента вместо настройки инструментов.","благодарности#Благодарности":"Hextra не может быть создана без следующих инструментов и вдохновений:\nHugo Tailwind CSS Heroicons Nextra Next.js"},"title":"О нас"},"/docs/":{"data":{"qwer-host-wiki#qwer-host Wiki":"qwer-host WikiДобро пожаловать в документацию qwer-host! Это централизованная база знаний для работы с нашими игровыми серверами и веб-сервисами.\nНаша вики содержит подробные руководства по администрированию серверов Minecraft, настройке плагинов, управлению веб-ресурсами и решению технических вопросов. Здесь собрана вся необходимая информация для эффективной работы с нашей инфраструктурой.","нужна-помощь#Нужна помощь?":"💬 Свяжитесь с поддержкой 📧 Напишите нам на email 📖 Посетите наш форум Совет: Используйте поиск в верхней части страницы для быстрого поиска нужной информации."},"title":"Документация"},"/docs/cloudflare/":{"data":{"cloudflare-руководства-и-инструкции#CloudFlare: Руководства и инструкции":"CloudFlare: Руководства и инструкцииCloudFlare — это глобальная сеть доставки контента (CDN) и платформа для обеспечения безопасности веб-сайтов. В этом разделе вы найдете полезные руководства по настройке и управлению вашими доменами через CloudFlare.","дополнительные-ресурсы#Дополнительные ресурсы":"Официальная документация CloudFlare CloudFlare API документация Сообщество CloudFlare","доступные-руководства#Доступные руководства":"В этом разделе представлены следующие инструкции:\nПривязка домена к Minecraft серверу — как настроить A и SRV записи для красивого адреса сервера Отключение Encrypted Client Hello (ECH) — как отключить ECH через API для пользователей из России Важно: Работа с API CloudFlare требует аккуратности. Всегда сохраняйте резервные копии настроек и проверяйте правильность вводимых данных.","основные-возможности-cloudflare#Основные возможности CloudFlare":"CloudFlare предоставляет множество функций:\nCDN — ускорение загрузки сайта за счет распределенной сети серверов DDoS защита — защита от распределенных атак SSL/TLS — бесплатные SSL сертификаты DNS управление — быстрые и надежные DNS серверы Firewall — настраиваемые правила безопасности"},"title":"CloudFlare"},"/docs/cloudflare/disable-ech/":{"data":{"1-настройка-запроса#1. Настройка запроса":"Метод: PATCH URL: https://api.cloudflare.com/client/v4/zones/{ID_ZONE}/settings/ech","2-настройка-headers#2. Настройка Headers":"В разделе Headers добавьте следующие поля:\nKey Value X-Auth-Email ваш email-адрес Cloudflare X-Auth-Key ваш Global API Key Content-Type application/json","3-настройка-body#3. Настройка Body":"В разделе Body выберите raw и JSON, затем введите:\n{ \"id\": \"ech\", \"value\": \"off\" }","4-отправка-запроса#4. Отправка запроса":"Нажмите кнопку Send и дождитесь ответа от сервера.","ech-не-отключается#ECH не отключается":"Проблема: После выполнения команды ECH остается включенным\nРешение:\nПодождите 10-15 минут для применения изменений Очистите DNS-кеш на вашем устройстве Повторите запрос к API","global-api-key#Global API Key":"Перейдите на страницу профиля Cloudflare Найдите раздел с вашим Global API Key и скопируйте ключ Важно: Global API Key дает полный доступ к вашему аккаунту. Никогда не делитесь им с третьими лицами и храните в безопасном месте!","zone-id#Zone ID":"Зайдите в панель управления вашим доменом в Cloudflare Прокрутите страницу вниз в правой колонке Скопируйте значение Zone ID Zone ID — это уникальный идентификатор вашего домена в системе Cloudflare.","возможные-проблемы-и-решения#Возможные проблемы и решения":"","дополнительные-ресурсы#Дополнительные ресурсы":"Официальная документация Cloudflare API Руководство по настройке SSL/TLS в Cloudflare Сообщество Cloudflare Нужна помощь? Если у вас возникли сложности с отключением ECH, обратитесь в поддержку Cloudflare или на форумы сообщества.","зачем-отключать-ech#Зачем отключать ECH?":"Роскомнадзор заблокировал технологию Encrypted Client Hello (ECH), что вызвало проблемы для пользователей Cloudflare в России. Более того, Cloudflare принудительно активировал эту технологию для всех пользователей, включая тех, кто находится на бесплатном тарифе.\nВ этом гайде мы разберем, как отключить ECH для вашего домена через Cloudflare API.\nДля пользователей из России: Отключение ECH может быть необходимо для обеспечения доступности вашего сайта для российских пользователей из-за блокировки этой технологии Роскомнадзором.","отключение-encrypted-client-hello-ech-на-бесплатном-тарифе-cloudflare-через-api#Отключение Encrypted Client Hello (ECH) на бесплатном тарифе Cloudflare через API":"Отключение Encrypted Client Hello (ECH) на бесплатном тарифе Cloudflare через API","ошибка-zone-id#Ошибка Zone ID":"Проблема: Получаете ошибку Zone not found\nРешение:\nУбедитесь, что Zone ID скопирован правильно Проверьте, что используете Zone ID именно того домена, который хотите изменить","ошибка-аутентификации#Ошибка аутентификации":"Проблема: Получаете ошибку Authentication error или Invalid credentials\nРешение:\nПроверьте правильность email-адреса Убедитесь, что скопировали Global API Key полностью Проверьте, что не добавили лишние пробелы при копировании","проверка-результата#Проверка результата":"После отключения ECH рекомендуется проверить изменения:\nПодождите 5-10 минут для применения настроек Снова выполните проверку через Google Public DNS (Шаг 1) Проверьте доступность вашего сайта для пользователей из России Готово! ECH теперь отключен для вашего домена, и сайт должен быть доступен для российских пользователей.","способ-1-использование-команды-curl#Способ 1: Использование команды curl":"Для отключения ECH выполните следующую команду в терминале, заменив {ID_ZONE}, {ACCOUNT_EMAIL} и {GLOBAL_API_KEY} на ваши данные:\ncurl -X PATCH \"https://api.cloudflare.com/client/v4/zones/{ID_ZONE}/settings/ech\" \\ -H \"X-Auth-Email: {ACCOUNT_EMAIL}\" \\ -H \"X-Auth-Key: {GLOBAL_API_KEY}\" \\ -H \"Content-Type: application/json\" \\ --data '{\"id\":\"ech\",\"value\":\"off\"}'\rПример:\ncurl -X PATCH \"https://api.cloudflare.com/client/v4/zones/abc123def456/settings/ech\" \\ -H \"X-Auth-Email: user@example.com\" \\ -H \"X-Auth-Key: c2547eb745079dac9320b638f5e225cf483cc5cfdda41\" \\ -H \"Content-Type: application/json\" \\ --data '{\"id\":\"ech\",\"value\":\"off\"}'\rПри успешном выполнении вы получите JSON-ответ с подтверждением изменения настройки.","способ-2-использование-postman#Способ 2: Использование Postman":"Вы можете выполнить этот запрос через Postman, следуя инструкциям:","способ-3-в-случае-с-платным-тарифом#Способ 3: В случае с платным тарифом":"Если вы используете платный тариф Cloudflare, отключить ECH можно через интерфейс панели управления:\nПерейдите в раздел SSL/TLS Откройте вкладку Edge Certificates Найдите настройку Encrypted ClientHello (ECH) Установите значение Disabled Обратите внимание: Эта опция доступна только для пользователей платных тарифов (Pro, Business, Enterprise).","шаг-1-проверка-включения-ech#Шаг 1: Проверка включения ECH":"Прежде чем отключать ECH, проверьте, включен ли он для вашего домена. Это можно сделать с помощью запроса к Google Public DNS:\nПерейдите по следующей ссылке, заменив [ВАШ_ДОМЕН] на имя вашего домена: https://dns.google/resolve?name=[ВАШ_ДОМЕН]\u0026type=HTTPS\rЕсли в результатах видно, что ECH активен, переходите к следующему шагу. Пример: Для домена example.com ссылка будет выглядеть так:\nhttps://dns.google/resolve?name=example.com\u0026type=HTTPS","шаг-2-получение-данных-для-cloudflare-api#Шаг 2: Получение данных для Cloudflare API":"Для взаимодействия с API вам понадобятся два ключевых элемента:","шаг-3-отключение-ech-через-cloudflare-api#Шаг 3: Отключение ECH через Cloudflare API":""},"title":"Отключение Encrypted Client Hello (ECH)"},"/docs/cloudflare/domain-setup/":{"data":{"-cloudflare-показывает-ошибку-при-создании-записи#❌ Cloudflare показывает ошибку при создании записи":"Причина: Неправильный формат данных\nРешение:\nУбедитесь, что Target оканчивается на . или содержит полное доменное имя Проверьте, что все обязательные поля заполнены Используйте только разрешённые символы (a-z, 0-9, дефис, точка)","-ошибка-неизвестный-хост-или-unknown-host#❌ Ошибка: \u0026ldquo;Неизвестный хост\u0026rdquo; или \u0026ldquo;Unknown host\u0026rdquo;":"Причины:\nDNS-записи ещё не распространились Ошибка в настройке A-записи Proxy Status включён (оранжевое облачко) Решение:\nПроверьте, что Proxy Status выключен для A-записи Подождите 15-30 минут Очистите DNS-кеш на компьютере: Windows: ipconfig /flushdns macOS: sudo dscacheutil -flushcache Linux: sudo systemd-resolve --flush-caches","-ошибка-подключение-по-домену-работает-но-с-неправильным-портом#❌ Ошибка: Подключение по домену работает, но с неправильным портом":"Причина: SRV-запись настроена неправильно или отсутствует\nРешение:\nПроверьте наличие SRV-записи Убедитесь, что порт указан правильно Проверьте формат Name: _minecraft._tcp.(поддомен)","1-проверка-a-записи#1. Проверка A-записи":"Выполните команду в терминале:\nnslookup play.mhcore.xyz\rВы должны увидеть IP-адрес вашего сервера в результате.","2-проверка-srv-записи#2. Проверка SRV-записи":"nslookup -type=srv _minecraft._tcp.play.mhcore.xyz\rДолжна отобразиться информация о порте и целевом адресе.","3-проверка-через-minecraft#3. Проверка через Minecraft":"Просто попробуйте подключиться к серверу через Minecraft клиент, используя ваш новый домен!","время-применения-изменений#Время применения изменений":"Обратите внимание:\nDNS-записи могут применяться не мгновенно. Обычно изменения вступают в силу:\nCloudflare: 1-5 минут По всему миру: от 1 часа до 48 часов (из-за кеширования DNS) Если домен сразу не работает — подождите 10-15 минут и попробуйте снова.","дополнительно-где-хранить-скриншоты#Дополнительно: Где хранить скриншоты?":"Скриншоты для документации размещайте в папке:\nstatic/images/docs/cloudflare/\rСтруктура:\na-record.png — скриншот настройки A-записи srv-record.png — скриншот настройки SRV-записи Чтобы вставить изображение в документацию, используйте:\n![Описание изображения](/images/docs/cloudflare/filename.png)","дополнительные-возможности#Дополнительные возможности":"","использование-cname-вместо-a-записи#Использование CNAME вместо A-записи":"Если ваш хостинг предоставляет выделенный адрес (например, server123.hosting.com), вы можете использовать CNAME-запись вместо A-записи:\nПоле Значение Type CNAME Name play Target server123.hosting.com Proxy status OFF","как-вместо-ip-адреса-использовать-свой-домен#Как вместо IP-адреса использовать свой домен?":"Как вместо IP-адреса использовать свой домен?Привязка домена к серверу необходима для того, чтобы сделать процесс подключения проще и быстрее. Обычно для подключения используется IP-адрес, который может быть длинным и сложным для запоминания (123.45.67.89:1234).\nЕсли вы привяжете домен, например, play.mhcore.xyz, то игрокам будет проще его запомнить, что может помочь с привлечением аудитории на ваш сервер.\nЗачем это нужно?\nЛегко запомнить: play.mhcore.xyz вместо 123.45.67.89:25565 Профессиональный вид вашего сервера Возможность сменить хостинг без изменения адреса для игроков","метод-1-настройка-через-a-запись-рекомендуется#Метод 1: Настройка через A-запись (Рекомендуется)":"","метод-2-настройка-без-a-записи-альтернатива#Метод 2: Настройка без A-записи (Альтернатива)":"Если ваш сервер размещён на хостинге MHCore, вы можете использовать адрес ноды напрямую:","несколько-серверов-на-одном-домене#Несколько серверов на одном домене":"Вы можете создать несколько поддоменов для разных серверов:\nplay.mhcore.xyz — основной сервер lobby.mhcore.xyz — лобби сервер creative.mhcore.xyz — креативный режим minigames.mhcore.xyz — мини-игры Для каждого создайте отдельные A и SRV записи с разными именами и портами!","подготовка#Подготовка":"Важно помнить!\nДля начала вам необходимо:\nПриобрести домен (например, на Namecheap, GoDaddy, REG.RU и т.д.) Перенести его в Cloudflare (бесплатно, но обязательно для этой инструкции) Если у вас уже есть домен в Cloudflare — переходите к следующему шагу!","полезные-ссылки#Полезные ссылки":"Официальная документация Cloudflare DNS Проверка DNS-записей онлайн Руководство по DNS для начинающих Нужна помощь?\nЕсли у вас возникли сложности с настройкой домена, обратитесь в поддержку вашего хостинга или Cloudflare.","пошаговая-инструкция#Пошаговая инструкция":"","проверка-настройки#Проверка настройки":"После создания записей рекомендуется проверить их корректность:","результат#Результат":"Согласно примеру выше, ваш сервер будет доступен по адресу:\nplay.mhcore.xyz\rИгроки смогут подключиться к серверу, просто введя этот адрес в Minecraft, без указания порта!\nГотово! 🎉\nТеперь игроки могут подключаться к вашему серверу по красивому и запоминающемуся адресу!","частые-ошибки-и-их-решение#Частые ошибки и их решение":"","шаг-1-откройте-панель-управления-cloudflare#Шаг 1: Откройте панель управления Cloudflare":"Перейдите на сайт Cloudflare Войдите в свой аккаунт Вы увидите список всех ваших доменов","шаг-2-выберите-домен#Шаг 2: Выберите домен":"Из списка доменов выберите тот, который хотите использовать для вашего Minecraft сервера.","шаг-3-перейдите-во-вкладку-dns#Шаг 3: Перейдите во вкладку \u0026ldquo;DNS\u0026rdquo;":"В верхнем меню найдите и нажмите на раздел DNS → Records.","шаг-4-альтернатива-создайте-только-srv-запись#Шаг 4 (альтернатива): Создайте только SRV-запись":"Поле Значение Type SRV Name _minecraft._tcp.play Priority 5 Weight 5 Port 25565 (порт вашего сервера) Target node1.mhcore.xyz (название вашей ноды) Для пользователей MHCore: В Target укажите адрес вашей ноды в формате: (название_ноды).mhcore.xyz\nПример: node1.mhcore.xyz, node2.mhcore.xyz и т.д.","шаг-4-создайте-новую-a-запись#Шаг 4: Создайте новую A-запись":"Нажмите кнопку Add record и заполните поля следующим образом:\nПоле Значение Описание Type A Тип записи Name play Любое название (поддомен) IPv4 address 123.45.67.89 IP-адрес вашего сервера БЕЗ ПОРТА Proxy status 🔴 OFF Оранжевое облачко должно быть выключено (серое) TTL Auto Оставьте без изменений Критически важно:\nProxy Status (оранжевое облачко) ОБЯЗАТЕЛЬНО должно быть выключено! В IPv4 указывайте IP БЕЗ ПОРТА (например, 123.45.67.89, а не 123.45.67.89:25565) Пример настройки A-записи:\nСохраните запись, нажав Save.","шаг-5-создайте-новую-srv-запись#Шаг 5: Создайте новую SRV-запись":"Теперь создайте SRV-запись для указания порта сервера. Нажмите Add record и заполните:\nПоле Значение Описание Type SRV Тип записи Name _minecraft._tcp.play Формат: _minecraft._tcp.(ваш_поддомен) Service _minecraft Автоматически заполнится Protocol TCP Автоматически заполнится TTL Auto Оставьте без изменений Priority 5 Приоритет записи Weight 5 Вес записи Port 25565 Порт вашего Minecraft сервера Target play.mhcore.xyz Формат: (название_A-записи).(ваш_домен) Разбор полей SRV-записи:\nName: _minecraft._tcp.play означает, что сервер будет доступен по адресу play.mhcore.xyz Port: Укажите порт вашего Minecraft сервера (обычно 25565 или другой) Target: Должен указывать на A-запись, которую вы создали (например, play.mhcore.xyz) Пример настройки SRV-записи:\nСохраните запись, нажав Save."},"title":"Привязка домена к Minecraft серверу"},"/docs/minecraft-commands/":{"data":{"":"В мире Minecraft управление сервером — это не просто запуск файла и наблюдение за тем, как игроки строят свои империи из блоков. Это искусство баланса между творчеством, безопасностью и динамикой сообщества. Если вы хотите превратить свой сервер в магнит для лояльных игроков, знание консольных команд станет вашим секретным оружием. Они позволяют мгновенно реагировать на инциденты, настраивать геймплей и поддерживать атмосферу, где каждый визит ощущается как приключение.\nПредставьте: новый игрок жалуется на лаги, а вы одним движением сохраняете мир и перезапускаете сервер. Или подозрительный юзер начинает griefing — и вот он уже в бан-листе. Эти команды — основа профессионального администрирования. Мы разберем их по категориям: от базового контроля доступа до тонкой настройки мира.\nВажные обозначения:\n\u003cУгловые скобки\u003e для обязательных параметров (например, \u003cникнейм\u003e) [Квадратные скобки] для опциональных дополнений (например, [причина]) В консоли сервера команды пишутся без слеша (/), в отличие от чата в игре Не вводите сами скобки — они только для понимания Готовы? Погружаемся в кодекс Minecraft!","быстрые-справочные-карточки#Быстрые справочные карточки":"Управление серверомБазовое управление сервером, белый список, баны и кики\rКоманды операторовУправление игроками, контроль мира, предметы и опыт\rПродвинутое администрированиеИнформация о сервере, коммуникация и инструменты отладки","заключение-станьте-мастером-сервера#Заключение: Станьте мастером сервера":"Поздравляем — вы только что освоили эссенцию консольного арсенала Minecraft! Но помните: настоящая магия в практике. Начните с малого: протестируйте на локальном сервере, поэкспериментируйте с комбо-командами (например, gamemode + give для креативного буста). Со временем вы интуитивно поймете, как команды переплетаются, создавая уникальный опыт для вашего сообщества.\nЕсли сервер растет, загляните в плагины вроде EssentialsX для расширения. А для глубокого погружения — официальная вики или свежие обновы 1.21+. Теперь ваш сервер не просто хостинг — это легенда. Удачи в строительстве империй! 🚀\nНужна дополнительная помощь?\nОзнакомьтесь с нашим Руководством по устранению неполадок для решения частых проблем Присоединяйтесь к нашему Discord сообществу для поддержки в реальном времени Посетите наш Форум для подробных обсуждений","команды-для-операторов-op-творческий-арсенал#Команды для операторов (OP): Творческий арсенал":"Если вы OP, то команды становятся вашим холстом. Они позволяют менять реальность на лету: от раздачи сокровищ до телепортации в параллельные измерения. В чате добавляйте / перед командой.\nУправление игрокамиКонтроль мираПредметы и опыт\rУправление игроками\rКоманда Описание Пример использования op \u003cникнейм\u003e Назначает оператора op TrustedPlayer deop \u003cникнейм\u003e Лишает прав оператора deop OldAdmin gamemode \u003cрежим\u003e [никнейм] Переключает режим игры (s/c/a для сокращений) gamemode creative Steve defaultgamemode \u003cрежим\u003e Устанавливает режим по умолчанию для новичков defaultgamemode creative tp \u003cникнейм1\u003e \u003cникнейм2\u003e Телепортирует одного к другому tp LostPlayer HomeBase tp \u003cникнейм\u003e Телепортирует по координатам tp Steve 100 64 200 spawnpoint [никнейм] [x y z] Устанавливает точку спауна spawnpoint Bob 100 64 200 Контроль мира\rКоманда Описание Пример использования difficulty \u003cуровень\u003e Меняет сложность: 0-3 difficulty 3 time set \u003cвремя/day/night\u003e Фиксирует время суток (0–23999 тиков) time set day toggledownfall Переключает дождь/снег toggledownfall weather Управляет погодой weather clear gamerule \u003cправило\u003e \u003cзначение\u003e Изменяет игровые правила gamerule keepInventory true Уровни сложности:\n0 = Мирный 1 = Лёгкий 2 = Нормальный 3 = Сложный Предметы и опыт\rКоманда Описание Пример использования give \u003cникнейм\u003e \u003cпредмет\u003e [кол-во] [data] Выдает предметы give Alice diamond_sword 1 clear \u003cникнейм\u003e [предмет] [data] Очищает инвентарь clear NoobPlayer 46 xp \u003cкол-во\u003e \u003cникнейм\u003e Добавляет/отнимает опыт (L для уровней) xp 100L DiamondMiner enchant \u003cникнейм\u003e \u003cзачарование\u003e [уровень] Зачаровывает предмет в руках enchant Steve sharpness 5 Осторожно с командой Give: Некоторые предметы могут нарушить игровой баланс. Используйте ответственно, особенно с мощными зачарованными предметами.","команды-для-управления-мультиплеером-консоль-сервера#Команды для управления мультиплеером (консоль сервера)":"Эти инструменты — ваш щит и меч в борьбе за порядок. Они помогают фильтровать аудиторию, мониторить активность и обеспечивать стабильность.\nБазовое управлениеБелый списокБаны и кики\rБазовое управление сервером\rКоманда Описание Пример использования list Показывает всех онлайн-игроков. Быстрый чек активности list save-all Принудительно сохраняет весь мир. Спасает от потерь при сбоях save-all save-off Отключает автоматическое сохранение (экономит ресурсы во время тестов) save-off save-on Включает авто-сохранение обратно save-on stop Грациозно останавливает сервер. Всегда используйте вместо Ctrl+C! stop Управление белым списком\rКоманда Описание Пример использования whitelist add \u003cникнейм\u003e Добавляет в белый список whitelist add NewFriend whitelist remove \u003cникнейм\u003e Удаляет из белого списка whitelist remove OldPlayer whitelist list Выводит полный список белого листа whitelist list whitelist on/off Включает/отключает режим белого списка whitelist on whitelist reload Перезагружает белый список после правок в файле whitelist reload Баны и кики\rКоманда Описание Пример использования ban \u003cникнейм\u003e [причина] Добавляет игрока в черный список ban Griefer123 \"Спам в чате\" ban-ip Блокирует доступ по IP ban-ip 192.168.1.1 kick \u003cникнейм\u003e [причина] Выкидывает игрока без бана kick TrollUser \"Правила сервера\" pardon \u003cникнейм\u003e Снимает бан с игрока pardon ReformedGriefer pardon-ip Разблокирует IP из черного списка pardon-ip 192.168.1.1 banlist [ips] Выводит список забаненных игроков или IP banlist ips","настройка-нового-игрока#Настройка нового игрока":"whitelist add NewPlayer tp NewPlayer SpawnArea give NewPlayer minecraft:bread 16 say \"Добро пожаловать NewPlayer на наш сервер!\"","популярные-комбинации-команд#Популярные комбинации команд":"Вот некоторые мощные последовательности команд, которые используют опытные администраторы:","продвинутое-администрирование#Продвинутое администрирование":"Информация о сервереКоммуникацияОтладка\rИнформация о сервере\rКоманда Описание Пример использования help [страница/команда] Справочник команд (? как алиас) help 2 publish Открывает локальный мир для LAN publish seed Показывает сид мира seed version Показывает версию сервера version Коммуникация\rКоманда Описание Пример использования say \u003cсообщение\u003e Транслирует розовое объявление всем say \"Сервер обновлен! Добро пожаловать!\" tell \u003cникнейм\u003e \u003cсообщение\u003e Личное сообщение игроку tell Steve \"Проверь новый магазин!\" me \u003cдействие\u003e Описывает действие от третьего лица me машет всем Отладка и производительность\rКоманда Описание Пример использования debug start/stop Запускает/останавливает профилирование debug start tps Показывает производительность сервера (TPS) tps gc Принудительная сборка мусора gc","профессиональные-советы-для-администраторов-серверов#Профессиональные советы для администраторов серверов":"Лучшие практики:\nРегулярные бэкапы: Используйте save-all перед любыми серьёзными изменениями Мониторинг активности: Регулярно проверяйте list и banlist Сначала тестируйте: Пробуйте команды на тестовом сервере перед продакшеном Документируйте изменения: Ведите журнал важных административных действий Будьте последовательны: Установите чёткие правила и справедливо их соблюдайте Напоминания о безопасности:\nДавайте статус OP только доверенным игрокам Регулярно проверяйте белый список и список банов Используйте команду stop вместо принудительного закрытия Следите за логами сервера на предмет подозрительной активности","управление-нарушителями#Управление нарушителями":"tp SuspiciousPlayer AdminArea gamemode spectator SuspiciousPlayer # Расследуем, затем решаем: ban SuspiciousPlayer \"Гриферство - постоянный бан\"","экстренное-обслуживание-сервера#Экстренное обслуживание сервера":"say \"Техническое обслуживание сервера через 5 минут!\" save-all # Ждём 5 минут kick @a \"Техническое обслуживание - возвращаемся через 10 минут\" stop"},"title":"Консольные команды для сервера Minecraft"},"/docs/minecraft-cores/":{"data":{"ванильные-ядра-база-для-плагинов-и-оптимизаций#Ванильные ядра: База для плагинов и оптимизаций":"Ванильные ядра — это основа для серверов на Bukkit/Spigot API, идеальные для мультиплеера с плагинами. Они эволюционировали от простого Vanilla к высокопроизводительным форкам вроде Paper. В 2025 году акцент на асинхронные улучшения и совместимость с последними версиями Minecraft (1.21+).\nРекомендуемыеУстаревшие\rТоповые ядра 2025\rЯдро Описание Рекомендация Ключевые особенности Paper Форк Spigot с глубокими оптимизациями: асинхронная обработка чанков, фиксы дублей и поддержка всех Bukkit/Spigot/Paper плагинов ✅ Высокая стабильность, конфиги в paper.yml для тонкой настройки Pufferfish Форк Paper с дополнительными патчами для крупных серверов: улучшенная обработка сущностей и SIMD-инструкции ✅ Лучше Paper для 100+ игроков; используйте флаг --add-modules=jdk.incubator.vector Purpur Форк Pufferfish/Paper с фокусом на кастомизацию: тысячи опций в purpur.yml для изменения механик ✅ Для серьёзных проектов; наследует все оптимизации + “fun” опции Leaf Экспериментальный форк Purpur с патчами из множества источников ❓ Мультипоточная обработка сущностей, но может быть нестабильным Устаревшие варианты\rЯдро Описание Рекомендация Почему избегать Vanilla Оригинальное ядро Mojang без плагинов ❌ Нет поддержки модов/плагинов; Paper обратно совместимо CraftBukkit Первое ядро с Bukkit-плагинами ❌ Не поддерживает современные плагины; заменено Spigot Spigot Форк CraftBukkit с базовыми оптимизациями ❌ Лаги на больших серверах; Paper — drop-in замена Совет: Начните с Paper — оно бесплатно, легко устанавливается и покрывает 90% нужд. Для сетей с 200+ игроков переходите на Pufferfish/Purpur.","гибриды-комбо-модов-и-плагинов#Гибриды: Комбо модов и плагинов":"Важное предупреждение: Плагины на гибридах работают нестабильно; поддержки от разработчиков ожидать не стоит. Риск крашей и уязвимостей высок.\rЯдро Описание Рекомендация Статус Arclight Активно развивается: поддержка Forge/NeoForge/Fabric модов + Bukkit-плагины ✅ Стабильнее аналогов; для 1.21.1+ Ketting Основан на Forge: поддержка Bukkit/Spigot/Paper плагинов + Forge-моды ❓ Активен для новых версий CatServer Похож на Ketting: Forge + ограниченные версии с Bukkit-плагинами ❓ Ограниченная поддержка версий Mohist Forge + Bukkit/Spigot/Paper плагины 💀 Устаревший, с рисками безопасности","заключение-выберите-ядро-под-свой-сервер#Заключение: Выберите ядро под свой сервер":"В 2025 году рекомендации просты:\nДля плагин-серверов: Paper → Pufferfish → Purpur (по возрастанию сложности) Для сетей: Velocity (обязательно) Для модов: Fabric/Quilt для новых проектов, NeoForge для Forge-наследия Для гибридов: Только Arclight, и то с осторожностью Начните с тестового сервера: скачайте с официальных сайтов (papermc.io, fabricmc.net, neoforged.net) и мониторьте с помощью Spark-плагина.\rИзбегайте устаревших вроде Spigot или BungeeCord — они уязвимы и медленны. Если ваш проект растёт, инвестируйте в хостинг с JVM-флагами Aikar для +20% производительности.\nТеперь ваш сервер готов к эпичным приключениям! 🚀","модовые-ядра-для-глубокого-кастома-с-модами#Модовые ядра: Для глубокого кастома с модами":"Модовые лоадеры позволяют добавлять контент: новые блоки, биомы, механики. В 2025 году Fabric лидирует по популярности благодаря скорости обновлений.\nСовременныеLegacy\rАктуальные лоадеры\rЯдро Описание Рекомендация Особенности Fabric Лёгкий и быстрый modloader: быстрая адаптация к новым версиям ✅ Популярен для 1.21+; простая установка, низкий overhead Quilt Форк Fabric с улучшениями: больше фич для моддеров ✅ Совместим с Fabric-модами; расширенные API NeoForge Форк Forge без поддержки старых модов: фокус на стабильности ✅ Быстрее Forge; растущая экосистема Legacy варианты\rЯдро Описание Рекомендация Статус Forge Классический modloader с огромной библиотекой модов ❓ Тяжёлый и медленный в обновлениях Совет: Выбирайте Fabric/Quilt для свежих модпаков — они легче и обновляются быстрее. NeoForge — если вы фанат Forge-модов.","полезные-ссылки#Полезные ссылки":"Paper MC - Официальный сайт Paper Fabric MC - Официальный сайт Fabric NeoForged - Официальный сайт NeoForge Velocity - Официальный сайт Velocity","прокси-ядра-для-сетей-серверов-и-защиты#Прокси-ядра: Для сетей серверов и защиты":"Прокси-ядра соединяют несколько серверов в сеть (например, хаб + миниигры), добавляя балансировку нагрузки и анти-DDoS. В 2025 году Velocity лидирует благодаря скорости и безопасности.\nЯдро Описание Рекомендация Ключевые особенности Velocity Современный прокси от команды Paper: высокая производительность, встроенная поддержка модов ✅ Масштабируемость для тысяч игроков; API для кастомных фич NullCordX Платный форк Waterfall с фокусом на антибот и DDoS-защиту ✅ (платный) Активные обновы, низкий пинг; от $10/мес BungeeCord Оригинальный прокси: базовый, но полный дыр в безопасности ❌ Устарел; используйте Waterfall как замену Waterfall Форк BungeeCord с фиксами уязвимостей 💀 Поддержка приостановлена; миграция на Velocity Важно: Velocity — выбор №1 для 2025. Он быстрее Waterfall на 2-3x и поддерживает современные фичи.","ядра-для-minecraft#Ядра для Minecraft":"Ядра для MinecraftВ эру Minecraft 1.21+ и за её пределами выбор серверного ядра — это не просто техническая деталь, а стратегический шаг, определяющий стабильность, производительность и уникальность вашего мира. Представьте: ваш сервер не просто хостит игроков, а создаёт экосистему, где оптимизации Paper разгоняют тысячи подключений, а моды Fabric добавляют измерения за пределами ванильного опыта.\nНо с обилием форков, прокси и гибридов легко запутаться. Мы разберём ключевые варианты по категориям, опираясь на актуальные тенденции 2025 года: от фокуса на производительности до поддержки модов.\nОбозначения рекомендаций:\n✅ — Топ-выбор для 2025 ❓ — Экспериментальный вариант ❌ — Не рекомендуется 💀 — Устаревший/заброшенный"},"title":"Ядра для Minecraft"}}